#+author: Rodrigo Francisco
#+date: <2021-09-03 Fri>

** Permisos y manejo de usuarios en Linux

#+begin_src shell
ls -l
#+end_src

#+RESULTS:
| total      | 364 |          |          |        |     |    |       |                                |
| drwxr-xr-x |   2 | rhodstar | rhodstar |   4096 | Sep | 29 | 19:03 | README.assets                  |
| -rwxr--r-- |   1 | rhodstar | rhodstar |   5533 | Sep | 29 | 19:05 | README.org                     |
| drwxr-xr-x |   2 | rhodstar | rhodstar |   4096 | Sep | 15 | 19:43 | t02                            |
| -rw-r--r-- |   1 | rhodstar | rhodstar |   3203 | Sep | 14 | 13:29 | TSIC2-tarea01-BIOS-vs-UEFI.org |
| -rw-r--r-- |   1 | rhodstar | rhodstar |  93755 | Sep |  9 | 22:52 | TSIC2-tarea01-BIOS-vs-UEFI.pdf |
| -rw-r--r-- |   1 | rhodstar | rhodstar |   6693 | Sep | 15 | 19:53 | TSIC2-tarea02-shells.org       |
| -rw-r--r-- |   1 | rhodstar | rhodstar | 235915 | Sep | 15 | 20:00 | TSIC2-tarea02-shells.pdf       |
| -rw-r--r-- |   1 | rhodstar | rhodstar |   8748 | Sep | 15 | 20:00 | TSIC2-tarea02-shells.tex       |

- r = 2^2 = 4
- w = 2^1 = 2
- x = 2^0 = 1

Entonces
- rwx = 7
- rw = 5
- r = 4

#+begin_src shell
useradd rodrigo # Crea el usuario con su directorio

cd /home/rodrigo
ls -ld /home/rodrigo
touch test01
ls -l /home/rodrigo/test01 # Permisos de lectura por defecto para grupo y otros
mkdir Test01
ls -ld Test01 # Permisos de ejecucion para grupo y otros
#+end_src

Para los /archivos/ los permisos por defecto son  /644/ y para /directorio/ son  /777/

- Archivo
  + Permisos por default: 666
  + *umask*: 644
- Directorio
  + Permiso por defecto: 777
  + *umask*: 755

#+begin_src shell
umask # Deber regresar 022

umask 111
touch test02
ls -l test02 # Mascara: 666

umask 0077
touch test03
ls -l test03 # Mascara 600
mkdir Test03
ls -ld Test03 # 700
#+end_src

Creación de usuarios

#+begin_src shell
sudo su rodrigo
id

cat /etc/passwd
useradd -u 1010 -c "usuario prueba" fulanito
cat /etc/passwd

cat /etc/group
#+end_src

Usuarios y grupos

#+begin_src shell
groupadd --help
groupadd -g 1100 seguridad
cat /etc/group
useradd -u 1101 -g 1100 policia01
useradd -u 1102 -g seguridad policia02

usermod -g 1100 fulanito # Fulanito ahora es parte del gpo seguridad
usermod -G 1100 rodrigo # rodrigo, se encuentra como parte del segurida en /etc/group

groupadd -g 1200 administrator
usermod -G 1200,1100 rodrigo
#+end_src

#+begin_src shell
passwd policia03
su - policia03
touch Test01
ls -l # 644
chmod 646 Test01 # Cambiando permisos
ls -l #646

chmod 700 Test01
ls -l Test01
chmod g+rw Test01
#+end_src

#+begin_src shell
groupadd -g 2000 finanzas
useradd -g 2000 -u 2001 contador01
useradd -g 2000 -u 2002 contador02
useradd -g 2000 -u 2003 contador03

mkdir /finanzas /seguridad
ls -ld /finanzas /seguridad
chgrp seguridad /seguridad
umask 0022
chmod 770 /seguridad

su - contador01
cd /seguridad # No nos debería dejar

su - policia01
touch 01
cat 01
exit
su -l policia02
cat 01
vi 01 # Brecha de seguridad
#+end_src

